app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "encrypted_password", "name", "salt", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(params[:user])
    if @user.save

SELECT "users".* FROM "users" LIMIT 30 OFFSET 0
---
  def index
    @title = "All users"
    @users = User.paginate(:page => params[:page])